# Этап 1: Сборка зависимостей
FROM node:16 as builder

# Устанавливаем рабочую директорию в контейнере
WORKDIR /usr/src/app

# Копируем файлы package.json и package-lock.json (если он есть)
COPY package*.json ./

# Устанавливаем зависимости, включая нативные модули
RUN npm install --force

# Копируем все файлы проекта в рабочую директорию
COPY . .

# Этап 2: Подготовка к запуску
FROM node:16

# Устанавливаем рабочую директорию в контейнере
WORKDIR /usr/src/app

# Копируем установленные зависимости из предыдущего этапа
COPY --from=builder /usr/src/app .

# Определяем переменную окружения для порта нашего сервера
ENV PORT=4444

# Открываем порт 4444
EXPOSE 4444

# Команда для запуска нашего приложения через nodemon для разработки
CMD ["npm", "run", "start:dev"]